### Terraform Plan Result (dev)

#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.google_secret_manager_secret_version.db_password: Reading...
module.vpc.google_compute_network.vpc: Refreshing state... [id=projects/tokotoko-ea308/global/networks/vpc-tekutoko-dev]
google_compute_address.tekutoko_api: Refreshing state... [id=projects/tokotoko-ea308/regions/asia-northeast1/addresses/tekutoko-api-dev-ip]
data.google_secret_manager_secret_version.db_password: Read complete after 1s [id=projects/730739320416/secrets/db-password/versions/1]
module.vpc.google_compute_subnetwork.primary: Refreshing state... [id=projects/tokotoko-ea308/regions/asia-northeast1/subnetworks/subnet-asia-northeast1-dev-primary]
module.cloud_nat.google_compute_router.router: Refreshing state... [id=projects/tokotoko-ea308/regions/asia-northeast1/routers/router-asia-northeast1-dev]
module.firewall.google_compute_firewall.allow_health_checks: Refreshing state... [id=projects/tokotoko-ea308/global/firewalls/dev-allow-health-checks]
module.firewall.google_compute_firewall.allow_gke_control_plane: Refreshing state... [id=projects/tokotoko-ea308/global/firewalls/dev-allow-gke-control-plane]
module.firewall.google_compute_firewall.allow_iap_ssh: Refreshing state... [id=projects/tokotoko-ea308/global/firewalls/dev-allow-iap-ssh]
module.firewall.google_compute_firewall.allow_internal_pods: Refreshing state... [id=projects/tokotoko-ea308/global/firewalls/dev-allow-internal-pods]
module.cloud_nat.google_compute_router_nat.nat: Refreshing state... [id=tokotoko-ea308/asia-northeast1/router-asia-northeast1-dev/nat-asia-northeast1-dev]
module.cloud_sql.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/tokotoko-ea308/global/addresses/tekutoko-dev-db-private-ip]
module.gke.google_container_cluster.autopilot: Refreshing state... [id=projects/tokotoko-ea308/locations/asia-northeast1/clusters/gke-tekutoko-dev]
module.cloud_sql.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Ftokotoko-ea308%2Fglobal%2Fnetworks%2Fvpc-tekutoko-dev:servicenetworking.googleapis.com]
module.cloud_sql.google_sql_database_instance.postgres: Refreshing state... [id=tekutoko-dev-db]
module.cloud_sql.google_sql_database.database: Refreshing state... [id=projects/tokotoko-ea308/instances/tekutoko-dev-db/databases/tekutoko_dev]
module.cloud_sql.google_sql_user.default_user: Refreshing state... [id=tekutoko//tekutoko-dev-db]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke.google_container_cluster.autopilot has been deleted
  - resource "google_container_cluster" "autopilot" {
      - endpoint                                 = "35.243.77.79" -> null
      - id                                       = "projects/tokotoko-ea308/locations/asia-northeast1/clusters/gke-tekutoko-dev" -> null
      - name                                     = "gke-tekutoko-dev" -> null
        # (36 unchanged attributes hidden)

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRUzZQMFNwZVpNeDZZVEFXQ25pRnVQekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRME1XTTFNVGt6T1Mwek1qWXdMVFJrWXpZdE9EZzBZaTFsTVRnM056SmhOMlk0TmpndwpJQmNOTWpVeE1qQTRNVEV3TnpReFdoZ1BNakExTlRFeU1ERXhNakEzTkRGYU1DOHhMVEFyQmdOVkJBTVRKRFF4Cll6VXhPVE01TFRNeU5qQXROR1JqTmkwNE9EUmlMV1V4T0RjM01tRTNaamcyT0RDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQUoyWnRqWDZkb3JKUTdJVXNJSWtwM3B6ZnYvRzVHZUw4MUF1V3dmSgpTZjQ4c0l2WWtRZmFha3hkNjVvM3NWOEZ6V1ZDQ2Q2cVBCeWgrRkpXVk94anJUZUJHZDgwZy9DZVdHU3hIN0cwCmpvK00rTE9UUzJjWjV3NnhXNUwvQTVKbzJoOWozcVN5OWhlMGpXMGNWNjRKN3Z1MWx1cnd0ek9UZllIbTN0dVUKbzQyby9hN3lDblNYOE1Ecms2b2pKTkRmVk8rRjlRbVQvaHB4c1ExVnhuZUdrSndQU2U0MzV4aklGZWFMaFRrTgpUT1h1VUR2a0tmN3VGZzB1ejg0a2Y3R1o2RkNtT2JXZzZVbDRIaEFHQUJJcVZqYjhkaGNjRTFXaVpmMjZ1TlVTClJCbjRQVXYzV3FBdGRheW84bFpkMjNUMlBsRWc5dkhjZEpSaU5aVGRrWTE0Q0Y0VktnVUNMY1lrd2kwWCsrRncKZ0dXc0V6WGU4bG1uY2hKeXB3akhWbTdpV3l5K0R2ZXYxVXNRMWwrcWdBb2xwY3VrbDk3aElsYkd5bG43c250NQp6RmVuMG9VTEVGWGVaVll6bG9uQ0FxTjRPcEp1VVkxLzZZTUMrSVRhQzdRbzY4dUtGeFBnTnFnRmMyeEZsMkpTCmNUZlBXR3pxZC8xRkE1OWIwdmEvd2tqbG53SURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVV4UStqKzdwWFRkSVQrL05kbytLdi9nS3JpVmd3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFGUkU1dm1XTHQ1eHlyVHFSKy9QampmWGlESk5CQzVEbFdkZ3lCYVNvU0tMClh2Ny8yaFRwRzdOVWh6MElkV25oYU5GckJNdEMvY1FrWHJNcU9KNmQ0UTlJc3crV0VpYkxBYW14ZnBTN0orTVkKM0pac3cvaGJlSGFicXI1RUdidTNnbGw1ZmJGOVNnQzZyZ3BzQmpTVG1WZmVoSHVqV0l3a0hiYU1Sc0dwTDlMTgpiVE5uVGRzVlovdjZwTTU1Z01vUmpzNVRXV2oxTEw0eXQ0ZmFwVHJBeE83SGtVUlJQNFZsaDJaSi9KQ011VWVPCmpNYW1qaktoSFFjSDZRS2NCZnlBMXJudjNkMUc2SjlEcCs5V0sza0dYeHB0Y01nVUJmVjg0V3lOamszV0dzNVkKa2VzanF3WVdtVlFCa010dER4NTVSUFZHM3J2TzBwcUJtb0dHdEFkcG50OTJ4UDhzTklDaFZ4UkZqTzBFRFNPMwo2TXVqakVCN1hOeG1XTnlkSlJSZ1FoTFJEeWVPb25NMFFZUWp3cVZPMndTZld1ZW9iT21ja0dwWldoWW1Wam1jCkNuVGlzdlNsWlU2ZDJBMmtBZEZ3eFpnaWJEd2xQY3R1R0VGUHlFT1NUYjlpWnlFekNhN3M1ZFdGUmF3SW02dW0KQ3gxZFZJaHFZZm4vdHFERXdaWEIyUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      - private_cluster_config {
          - master_ipv4_cidr_block      = "172.16.0.0/28" -> null
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (36 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloud_sql.google_sql_user.default_user will be updated in-place
  ~ resource "google_sql_user" "default_user" {
        id                      = "tekutoko//tekutoko-dev-db"
        name                    = "tekutoko"
      ~ password                = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.gke.google_container_cluster.autopilot will be created
  + resource "google_container_cluster" "autopilot" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + description                              = "GKE Autopilot cluster for dev environment"
      + disable_l4_lb_firewall_reconciliation    = false
      + effective_labels                         = {
          + "cluster"                    = "gke-tekutoko-dev"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "project"                    = "tekutoko"
        }
      + enable_autopilot                         = true
      + enable_cilium_clusterwide_network_policy = false
      + enable_fqdn_network_policy               = false
      + enable_intranode_visibility              = true
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "asia-northeast1"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "gke-tekutoko-dev"
      + network                                  = "https://www.googleapis.com/compute/v1/projects/tokotoko-ea308/global/networks/vpc-tekutoko-dev"
      + networking_mode                          = "VPC_NATIVE"
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "tokotoko-ea308"
      + resource_labels                          = {
          + "cluster"     = "gke-tekutoko-dev"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "https://www.googleapis.com/compute/v1/projects/tokotoko-ea308/regions/asia-northeast1/subnetworks/subnet-asia-northeast1-dev-primary"
      + terraform_labels                         = {
          + "cluster"                    = "gke-tekutoko-dev"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "project"                    = "tekutoko"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config (known after apply)

      + anonymous_authentication_config (known after apply)

      + authenticator_groups_config (known after apply)

      + cluster_autoscaling (known after apply)

      + confidential_nodes (known after apply)

      + control_plane_endpoints_config (known after apply)

      + cost_management_config (known after apply)

      + database_encryption (known after apply)

      + default_snat_status (known after apply)

      + enterprise_config (known after apply)

      + gateway_api_config (known after apply)

      + gke_auto_upgrade_config (known after apply)

      + identity_service_config (known after apply)

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "range-dev-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "range-dev-svc"
          + stack_type                    = "IPV4"

          + pod_cidr_overprovision_config (known after apply)
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + master_auth (known after apply)

      + master_authorized_networks_config (known after apply)

      + mesh_certificates (known after apply)

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
            ]

          + advanced_datapath_observability_config (known after apply)

          + managed_prometheus (known after apply)
        }

      + node_config (known after apply)

      + node_pool (known after apply)

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config (known after apply)

      + pod_autoscaling (known after apply)

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "172.16.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = true
            }
        }

      + rbac_binding_config (known after apply)

      + release_channel {
          + channel = "REGULAR"
        }

      + security_posture_config (known after apply)

      + service_external_ips_config (known after apply)

      + vertical_pod_autoscaling (known after apply)

      + workload_identity_config {
          + workload_pool = "tokotoko-ea308.svc.id.goog"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ gke_cluster_endpoint      = (sensitive value)

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

```

</details>

*Pusher: @RRRRRRR-777, Action: `pull_request`, Workflow: `Terraform CI`*